Terraform Plan Output:
```
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Reading...
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_key.custom_s3_kms_key[0]: Refreshing state... [id=fc5f9f25-2081-4afa-a8cf-c21fe167ac7a]
module.appcd_b71fd16c-797e-5a95-8e1b-ab22f1e34f43.aws_iam_role.this: Refreshing state... [id=rm897]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket.this: Refreshing state... [id=ram789]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Read complete after 0s [id=222634395437]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_public_access_block.this: Refreshing state... [id=ram789]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_iam_policy_document.website_bucket_policy[0]: Reading...
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=ram789]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_alias.a[0]: Refreshing state... [id=alias/s3-ram789]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_website_configuration.this[0]: Refreshing state... [id=ram789]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_iam_policy_document.website_bucket_policy[0]: Read complete after 0s [id=743262692]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=ram789]
module.appcd_a7409093-08cd-45c4-acd8-15690667956f.aws_iam_role_policy.this: Refreshing state... [id=rm897:aws_s3-hello-kitty-policy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "hello-kitty-function"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::222634395437:role/rm897"
      + runtime                        = "python3.8"
      + s3_bucket                      = "ram789"
      + s3_key                         = "built/app.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "appstack"  = "kaim"
          + "component" = "hello-kitty"
        }
      + tags_all                       = {
          + "appstack"  = "kaim"
          + "component" = "hello-kitty"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "IMAGES_BUCKET" = "ram789"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function_url.this[0] will be created
  + resource "aws_lambda_function_url" "this" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "hello-kitty-function"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + invoke_mode        = "BUFFERED"
      + url_id             = (known after apply)
    }

  # module.appcd_389aa326-2165-433e-b05b-ce12845a5cb3.aws_iam_role_policy.this will be created
  + resource "aws_iam_role_policy" "this" {
      + id          = (known after apply)
      + name        = "Writer"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "rm897"
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_policy.website_bucket_policy[0] will be created
  + resource "aws_s3_bucket_policy" "website_bucket_policy" {
      + bucket = "ram789"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:s3:::ram789/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.appcd_86ec452a-770a-59bf-87dd-67ed883e25e5.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/hello-kitty-functionpol5"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "appstack"  = "kaim"
          + "component" = "hello-kitty"
        }
      + tags_all          = {
          + "appstack"  = "kaim"
          + "component" = "hello-kitty"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_name     = "/aws/lambda/hello-kitty-function" -> null
  + aws_cloudwatch_log_group_aws_lambda_hello_kitty_functionpol5_arn  = (known after apply)
  + aws_cloudwatch_log_group_aws_lambda_hello_kitty_functionpol5_name = "/aws/lambda/hello-kitty-functionpol5"
  + aws_lambda_hello_kitty_function_function_arn                      = (known after apply)
  + aws_lambda_hello_kitty_function_function_url                      = (known after apply)
  + aws_lambda_hello_kitty_function_invoke_arn                        = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```